bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA644.xml
                <register caption="USART Baud Rate Register Bytes" name="UBRR0" offset="0xC4" size="2" mask="0x0FFF"/>
            </register-group>
            <value-group caption="" name="COMM_USART_MODE_2BIT">
                <value caption="Asynchronous USART" name="VAL_0x00" value="0x00"/>
                <value caption="Synchronous USART" name="VAL_0x01" value="0x01"/>
                <value caption="Master SPI" name="VAL_0x03" value="0x03"/>
            </value-group>
            <value-group caption="" name="COMM_UPM_PARITY_MODE">
                <value caption="Disabled" name="VAL_0x00" value="0x00"/>
                <value caption="Reserved" name="VAL_0x01" value="0x01"/>
                <value caption="Enabled, Even Parity" name="VAL_0x02" value="0x02"/>
                <value caption="Enabled, Odd Parity" name="VAL_0x03" value="0x03"/>
            </value-group>
            <value-group caption="" name="COMM_STOP_BIT_SEL">
                <value caption="1-bit" name="VAL_0x00" value="0x00"/>
                <value caption="2-bit" name="VAL_0x01" value="0x01"/>
            </value-group>
        </module>
        <module caption="I/O Port" name="PORT">
            <register-group caption="I/O Port" name="PORTA">
                <register caption="Port A Data Register" name="PORTA" offset="0x22" size="1" mask="0xFF"/>
                <register caption="Port A Data Direction Register" name="DDRA" offset="0x21" size="1" mask="0xFF"/>
                <register caption="Port A Input Pins" name="PINA" offset="0x20" size="1" mask="0xFF" ocd-rw="R"/>
            </register-group>
            <register-group caption="I/O Port" name="PORTB">
                <register caption="Port B Data Register" name="PORTB" offset="0x25" size="1" mask="0xFF"/>
                <register caption="Port B Data Direction Register" name="DDRB" offset="0x24" size="1" mask="0xFF"/>
                <register caption="Port B Input Pins" name="PINB" offset="0x23" size="1" mask="0xFF" ocd-rw="R"/>
            </register-group>
            <register-group caption="I/O Port" name="PORTC">
                <register caption="Port C Data Register" name="PORTC" offset="0x28" size="1" mask="0xFF"/>
                <register caption="Port C Data Direction Register" name="DDRC" offset="0x27" size="1" mask="0xFF"/>
                <register caption="Port C Input Pins" name="PINC" offset="0x26" size="1" mask="0xFF" ocd-rw="R"/>
            </register-group>
            <register-group caption="I/O Port" name="PORTD">
                <register caption="Port D Data Register" name="PORTD" offset="0x2B" size="1" mask="0xFF"/>
                <register caption="Port D Data Direction Register" name="DDRD" offset="0x2A" size="1" mask="0xFF"/>
                <register caption="Port D Input Pins" name="PIND" offset="0x29" size="1" mask="0xFF" ocd-rw="R"/>
            </register-group>
        </module>
        <module caption="Timer/Counter, 8-bit" name="TC8">
            <register-group caption="Timer/Counter, 8-bit" name="TC0">
                <register caption="Timer/Counter0 Output Compare Register" name="OCR0B" offset="0x48" size="1"
                          mask="0xFF"/>
                <register caption="Timer/Counter0 Output Compare Register" name="OCR0A" offset="0x47" size="1"
                          mask="0xFF"/>
                <register caption="Timer/Counter0" name="TCNT0" offset="0x46" size="1" mask="0xFF"/>
                <register caption="Timer/Counter Control Register B" name="TCCR0B" offset="0x45" size="1">
                    <bitfield caption="Force Output Compare A" mask="0x80" name="FOC0A"/>
                    <bitfield caption="Force Output Compare B" mask="0x40" name="FOC0B"/>
                    <bitfield caption="" mask="0x08" name="WGM02"/>
                    <bitfield caption="Clock Select" mask="0x07" name="CS0" values="CLK_SEL_3BIT_EXT"/>
                </register>
                <register caption="Timer/Counter Control Register A" name="TCCR0A" offset="0x44" size="1">
                    <bitfield caption="Compare Output Mode, Phase Correct PWM Mode" mask="0xC0" name="COM0A"/>
                    <bitfield caption="Compare Output Mode, Fast PWm" mask="0x30" name="COM0B"/>
                    <bitfield caption="Waveform Generation Mode" mask="0x03" name="WGM0"/>
                </register>
                <register caption="Timer/Counter0 Interrupt Mask Register" name="TIMSK0" offset="0x6E" size="1">
                    <bitfield caption="Timer/Counter0 Output Compare Match B Interrupt Enable" mask="0x04"
                              name="OCIE0B"/>
                    <bitfield caption="Timer/Counter0 Output Compare Match A Interrupt Enable" mask="0x02"
                              name="OCIE0A"/>
                    <bitfield caption="Timer/Counter0 Overflow Interrupt Enable" mask="0x01" name="TOIE0"/>
                </register>
                <register caption="Timer/Counter0 Interrupt Flag register" name="TIFR0" offset="0x35" size="1"
                          ocd-rw="R">
                    <bitfield caption="Timer/Counter0 Output Compare Flag 0B" mask="0x04" name="OCF0B"/>
                    <bitfield caption="Timer/Counter0 Output Compare Flag 0A" mask="0x02" name="OCF0A"/>
                    <bitfield caption="Timer/Counter0 Overflow Flag" mask="0x01" name="TOV0"/>
                </register>
                <register caption="General Timer/Counter Control Register" name="GTCCR" offset="0x43" size="1">
                    <bitfield caption="Timer/Counter Synchronization Mode" mask="0x80" name="TSM"/>
                    <bitfield caption="Prescaler Reset Timer/Counter1 and Timer/Counter0" mask="0x01" name="PSRSYNC"/>
                </register>
            </register-group>
            <value-group caption="" name="CLK_SEL_3BIT_EXT">
                <value caption="No Clock Source (Stopped)" name="VAL_0x00" value="0x00"/>
                <value caption="Running, No Prescaling" name="VAL_0x01" value="0x01"/>
                <value caption="Running, CLK/8" name="VAL_0x02" value="0x02"/>
                <value caption="Running, CLK/64" name="VAL_0x03" value="0x03"/>
                <value caption="Running, CLK/256" name="VAL_0x04" value="0x04"/>
                <value caption="Running, CLK/1024" name="VAL_0x05" value="0x05"/>
                <value caption="Running, ExtClk Tn Falling Edge" name="VAL_0x06" value="0x06"/>
                <value caption="Running, ExtClk Tn Rising Edge" name="VAL_0x07" value="0x07"/>
            </value-group>
        </module>
        <module caption="Timer/Counter, 8-bit Async" name="TC8_ASYNC">
            <register-group caption="Timer/Counter, 8-bit Async" name="TC2">
                <register caption="Timer/Counter Interrupt Mask register" name="TIMSK2" offset="0x70" size="1">
                    <bitfield caption="Timer/Counter2 Output Compare Match B Interrupt Enable" mask="0x04"
                              name="OCIE2B"/>
                    <bitfield caption="Timer/Counter2 Output Compare Match A Interrupt Enable" mask="0x02"
                              name="OCIE2A"/>
                    <bitfield caption="Timer/Counter2 Overflow Interrupt Enable" mask="0x01" name="TOIE2"/>
                </register>
                <register caption="Timer/Counter Interrupt Flag Register" name="TIFR2" offset="0x37" size="1"
                          ocd-rw="R">
                    <bitfield caption="Output Compare Flag 2B" mask="0x04" name="OCF2B"/>
                    <bitfield caption="Output Compare Flag 2A" mask="0x02" name="OCF2A"/>
                    <bitfield caption="Timer/Counter2 Overflow Flag" mask="0x01" name="TOV2"/>
                </register>
                <register caption="Timer/Counter2 Control Register A" name="TCCR2A" offset="0xB0" size="1">
                    <bitfield caption="Compare Output Mode bits" mask="0xC0" name="COM2A"/>
                    <bitfield caption="Compare Output Mode bits" mask="0x30" name="COM2B"/>
                    <bitfield caption="Waveform Genration Mode" mask="0x03" name="WGM2"/>
                </register>
