bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA644.xml
            <value-group caption="" name="CPU_CLK_PRESCALE_4_BITS_SMALL">
                <value caption="1" name="VAL_0x00" value="0x00"/>
                <value caption="2" name="VAL_0x01" value="0x01"/>
                <value caption="4" name="VAL_0x02" value="0x02"/>
                <value caption="8" name="VAL_0x03" value="0x03"/>
                <value caption="16" name="VAL_0x04" value="0x04"/>
                <value caption="32" name="VAL_0x05" value="0x05"/>
                <value caption="64" name="VAL_0x06" value="0x06"/>
                <value caption="128" name="VAL_0x07" value="0x07"/>
                <value caption="256" name="VAL_0x08" value="0x08"/>
            </value-group>
            <value-group caption="" name="CPU_SLEEP_MODE_3BITS">
                <value caption="Idle" name="IDLE" value="0x00"/>
                <value caption="ADC Noise Reduction (If Available)" name="ADC" value="0x01"/>
                <value caption="Power Down" name="PDOWN" value="0x02"/>
                <value caption="Power Save" name="PSAVE" value="0x03"/>
                <value caption="Reserved" name="VAL_0x04" value="0x04"/>
                <value caption="Reserved" name="VAL_0x05" value="0x05"/>
                <value caption="Standby" name="STDBY" value="0x06"/>
                <value caption="Extended Standby" name="ESTDBY" value="0x07"/>
            </value-group>
            <value-group caption="Oscillator Calibration Values" name="OSCCAL_VALUE_ADDRESSES">
                <value value="0x00" caption="8.0 MHz" name="8_0_MHz"/>
            </value-group>
        </module>
    </modules>
    <pinouts>
        <pinout name="PDIP40" caption="PDIP40">
            <pin position="1" pad="PB0"/>
            <pin position="2" pad="PB1"/>
            <pin position="3" pad="PB2"/>
            <pin position="4" pad="PB3"/>
            <pin position="5" pad="PB4"/>
            <pin position="6" pad="PB5"/>
            <pin position="7" pad="PB6"/>
            <pin position="8" pad="PB7"/>
            <pin position="9" pad="RESET"/>
            <pin position="10" pad="VCC"/>
            <pin position="11" pad="GND"/>
            <pin position="12" pad="XTAL2"/>
            <pin position="13" pad="XTAL1"/>
            <pin position="14" pad="PD0"/>
            <pin position="15" pad="PD1"/>
            <pin position="16" pad="PD2"/>
            <pin position="17" pad="PD3"/>
            <pin position="18" pad="PD4"/>
            <pin position="19" pad="PD5"/>
            <pin position="20" pad="PD6"/>
            <pin position="21" pad="PD7"/>
            <pin position="22" pad="PC0"/>
            <pin position="23" pad="PC1"/>
            <pin position="24" pad="PC2"/>
            <pin position="25" pad="PC3"/>
            <pin position="26" pad="PC4"/>
            <pin position="27" pad="PC5"/>
            <pin position="28" pad="PC6"/>
            <pin position="29" pad="PC7"/>
            <pin position="30" pad="AVCC"/>
            <pin position="31" pad="GND"/>
            <pin position="32" pad="AREF"/>
            <pin position="33" pad="PA7"/>
            <pin position="34" pad="PA6"/>
            <pin position="35" pad="PA5"/>
            <pin position="36" pad="PA4"/>
            <pin position="37" pad="PA3"/>
            <pin position="38" pad="PA2"/>
            <pin position="39" pad="PA1"/>
            <pin position="40" pad="PA0"/>
        </pinout>
        <pinout name="TQFP_QFN_44" caption="TQFP_QFN_44">
            <pin position="1" pad="PB5"/>
            <pin position="2" pad="PB6"/>
            <pin position="3" pad="PB7"/>
            <pin position="4" pad="RESET"/>
            <pin position="5" pad="VCC"/>
            <pin position="6" pad="GND"/>
            <pin position="7" pad="XTAL2"/>
            <pin position="8" pad="XTAL1"/>
            <pin position="9" pad="PD0"/>
            <pin position="10" pad="PD1"/>
            <pin position="11" pad="PD2"/>
            <pin position="12" pad="PD3"/>
            <pin position="13" pad="PD4"/>
            <pin position="14" pad="PD5"/>
            <pin position="15" pad="PD6"/>
            <pin position="16" pad="PD7"/>
            <pin position="17" pad="VCC"/>
            <pin position="18" pad="GND"/>
            <pin position="19" pad="PC0"/>
            <pin position="20" pad="PC1"/>
            <pin position="21" pad="PC2"/>
            <pin position="22" pad="PC3"/>
            <pin position="23" pad="PC4"/>
            <pin position="24" pad="PC5"/>
            <pin position="25" pad="PC6"/>
            <pin position="26" pad="PC7"/>
            <pin position="27" pad="AVCC"/>
            <pin position="28" pad="GND"/>
            <pin position="29" pad="REF"/>
            <pin position="30" pad="PA7"/>
            <pin position="31" pad="PA6"/>
            <pin position="32" pad="PA5"/>
            <pin position="33" pad="PA4"/>
            <pin position="34" pad="PA3"/>
            <pin position="35" pad="PA2"/>
            <pin position="36" pad="PA1"/>
            <pin position="37" pad="PA0"/>
            <pin position="38" pad="VCC"/>
            <pin position="39" pad="GND"/>
            <pin position="40" pad="PB0"/>
            <pin position="41" pad="PB1"/>
            <pin position="42" pad="PB2"/>
            <pin position="43" pad="PB3"/>
            <pin position="44" pad="PB4"/>
        </pinout>
    </pinouts>
</target-description-file>
